Delans-TLE/src/Catalogs/НастройкиОбменСБанками/НастройкиОбменСБанками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиОбменСБанками</name>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияПоСертификату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>DefinedType.БанкОбменСБанками</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВерсияВнешнейКомпоненты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияФормата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВнешняяКомпонента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОрганизации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВнешнегоМодуля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяКриптография</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействительна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаБанка</name>
    <type>
      <types>EnumRef.ПрограммыБанка</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсВходящихДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РесурсИсходящихДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СертификатБанка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СжиматьДанныеПакетаЭД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДополнительнаяОбработка</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодразделенияБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсходящиеДокументы</name>
    <attributes>
      <name>ИсходящийДокумент</name>
      <type>
        <types>EnumRef.ВидыЭДОбменСБанками</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьЭП</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Формировать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МаршрутПодписания</name>
      <type>
        <types>CatalogRef.МаршрутыПодписания</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыПодписейОрганизации</name>
    <attributes>
      <name>СертификатЭП</name>
      <type>
        <types>CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Delans-TLE/src/Enums/ВидыЭДОбменСБанками/ВидыЭДОбменСБанками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭДОбменСБанками</name>
  <enumValues>
    <name>ВыпискаБанка</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеДанные</name>
  </enumValues>
  <enumValues>
    <name>ЗапросВыписки</name>
  </enumValues>
  <enumValues>
    <name>ЗапросЗонд</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтзывЭД</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНочнойВыписки</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>Квитанция</name>
  </enumValues>
  <enumValues>
    <name>ПлатежноеПоручение</name>
  </enumValues>
  <enumValues>
    <name>ПлатежноеТребование</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеЗачисленияДенежныхСредствНаСчетаСотрудников</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеОткрытияСчетовПоЗарплатномуПроекту</name>
  </enumValues>
  <enumValues>
    <name>ПоручениеНаПереводВалюты</name>
  </enumValues>
  <enumValues>
    <name>ПоручениеНаПокупкуВалюты</name>
  </enumValues>
  <enumValues>
    <name>ПоручениеНаПродажуВалюты</name>
  </enumValues>
  <enumValues>
    <name>РаспоряжениеНаОбязательнуюПродажуВалюты</name>
  </enumValues>
  <enumValues>
    <name>СписокНаЗачислениеДенежныхСредствНаСчетаСотрудников</name>
  </enumValues>
  <enumValues>
    <name>СписокНаОткрытиеСчетовПоЗарплатномуПроекту</name>
  </enumValues>
  <enumValues>
    <name>СписокУволенныхСотрудников</name>
  </enumValues>
  <enumValues>
    <name>СправкаОПодтверждающихДокументах</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОЗачисленииВалюты</name>
  </enumValues>
  <enumValues>
    <name>Письмо</name>
  </enumValues>
</mdclass:Enum>

Delans-TLE/src/Catalogs/НастройкиОбменСБанками/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Только для внутреннего использования. Проверяет что настройка уникальна.
//
// Возвращаемое значение:
//  Булево - если настройка уникальна, то истина.
//
Функция НастройкаОбменаУникальна() Экспорт
	
	Если ПометкаУдаления ИЛИ Недействительна Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) ИЛИ НЕ ЗначениеЗаполнено(Банк) Тогда
		Возврат Истина
	КонецЕсли;
	
	ТекущаяНастройкаУникальна = Истина;
	
	// Проверка на уникальное использование настройки по реквизитам: Организация, Банк
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяНастройка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Банк", Банк);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиОбмена.Банк,
	|	НастройкиОбмена.Организация
	|ИЗ
	|	Справочник.НастройкиОбменСБанками КАК НастройкиОбмена
	|ГДЕ
	|	НЕ НастройкиОбмена.ПометкаУдаления
	|	И НастройкиОбмена.Организация = &Организация
	|	И НастройкиОбмена.Банк = &Банк
	|	И НастройкиОбмена.Ссылка <> &ТекущаяНастройка
	|	И НЕ НастройкиОбмена.Недействительна";
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		ТекущаяНастройкаУникальна = Ложь;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ШаблонСообщения = НСтр("ru = 'В информационной базе уже существует действующая настройка обмена
									|между банком %1 и организацией %2'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.Банк, Выборка.Организация);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТекущаяНастройкаУникальна;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПометкаУдаления Тогда
		ПроверяемыеРеквизиты.Очистить();
		Возврат;
	КонецЕсли;
	
	ПроверяемыеРеквизиты.Очистить();
	
	Если НЕ ОбменСБанкамиКлиентСервер.ЗаполненыРеквизитыНастройкиОбмена(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Не НастройкаОбменаУникальна() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если ПрограммаБанка = Перечисления.ПрограммыБанка.АсинхронныйОбмен
		И НЕ ЗначениеЗаполнено(ВерсияФормата) Тогда
		ВерсияФормата = ОбменСБанкамиКлиентСервер.АктуальнаяВерсияФорматаАсинхронногоОбмена();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьПоддержкаПисем = ЕстьПоддержкаПисем();
	
	Если ЕстьПоддержкаПисем <> ПолучитьФункциональнуюОпцию("ПисьмаОбменСБанками") Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		Константы.ПисьмаОбменСБанками.Установить(ЕстьПоддержкаПисем);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьПоддержкаПисем()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НастройкиОбменСБанкамиИсходящиеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НастройкиОбменСБанками.ИсходящиеДокументы КАК НастройкиОбменСБанкамиИсходящиеДокументы
	|ГДЕ
	|	НастройкиОбменСБанкамиИсходящиеДокументы.ИсходящийДокумент = ЗНАЧЕНИЕ(Перечисление.ВидыЭДОбменСБанками.Письмо)
	|	И НЕ НастройкиОбменСБанкамиИсходящиеДокументы.Ссылка.ПометкаУдаления
	|	И НЕ НастройкиОбменСБанкамиИсходящиеДокументы.Ссылка.Недействительна";
	
	Результат = Запрос.Выполнить().Выбрать();
	Возврат Результат.Следующий();
	
КонецФункции

#КонецОбласти

#КонецЕсли
